Revit 2024 API
ParameterTypeId.ElemRoomNumber Property
 "Room Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ElemRoomNumber { get; }
Visual Basic
Public Shared ReadOnly Property ElemRoomNumber As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ElemRoomNumber {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace